[Killed] BlockStatement
src/mcp/handlers/errorHandler.ts:4:81
 import {McpError} from '../../types/mcp.js';
 
 export class McpErrorHandler {
-    static createError(code: number, message: string, data?: unknown): McpError {
-        const error = new Error(message) as McpError;
-        error.code = code;
-        error.data = data;
-        return error;
-    }
+    static createError(code: number, message: string, data?: unknown): McpError {}
 
     static invalidRequest(message: string, data?: unknown): McpError {
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:
4 | 
5 | describe('McpErrorHandler', () => {
6 |     test('should create error with code and message', () => {
7 |         const error = McpErrorHandler.createError(-32600, 'Test error');

[Killed] BlockStatement
src/mcp/handlers/errorHandler.ts:11:70
         return error;
     }
 
-    static invalidRequest(message: string, data?: unknown): McpError {
-        return this.createError(-32600, `Invalid Request: ${message}`, data);
-    }
+    static invalidRequest(message: string, data?: unknown): McpError {}
 
     static methodNotFound(method: string): McpError {
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:
19 |         expect(error.data).toEqual(testData);
20 |     });
21 | 
22 |     test('should create specific error types', () => {

[Killed] UnaryOperator
src/mcp/handlers/errorHandler.ts:12:33
     }
 
     static invalidRequest(message: string, data?: unknown): McpError {
-        return this.createError(-32600, `Invalid Request: ${message}`, data);
+        return this.createError(+32600, `Invalid Request: ${message}`, data);
     }
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

19 |         expect(error.data).toEqual(testData);
20 |     });
21 |

[Killed] StringLiteral
src/mcp/handlers/errorHandler.ts:12:41
     }
 
     static invalidRequest(message: string, data?: unknown): McpError {
-        return this.createError(-32600, `Invalid Request: ${message}`, data);
+        return this.createError(-32600, ``, data);
     }
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

20 |     });
21 | 
22 |     test('should create specific error types', () => {

[Killed] BlockStatement
src/mcp/handlers/errorHandler.ts:15:53
         return this.createError(-32600, `Invalid Request: ${message}`, data);
     }
 
-    static methodNotFound(method: string): McpError {
-        return this.createError(-32601, `Method not found: ${method}`);
-    }
+    static methodNotFound(method: string): McpError {}
 
     static invalidParams(message: string, data?: unknown): McpError {
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

23 |         const invalidRequest = McpErrorHandler.invalidRequest('Bad request');
24 |         expect(invalidRequest.code).toBe(-32600);
25 |         expect(invalidRequest.message).toBe('Invalid Request: Bad request');

[Killed] UnaryOperator
src/mcp/handlers/errorHandler.ts:16:33
     }
 
     static methodNotFound(method: string): McpError {
-        return this.createError(-32601, `Method not found: ${method}`);
+        return this.createError(+32601, `Method not found: ${method}`);
     }
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

23 |         const invalidRequest = McpErrorHandler.invalidRequest('Bad request');
24 |         expect(invalidRequest.code).toBe(-32600);
25 |         expect(invalidRequest.message).toBe('Invalid Request: Bad request');

[Killed] BlockStatement
src/mcp/handlers/errorHandler.ts:19:69
         return this.createError(-32601, `Method not found: ${method}`);
     }
 
-    static invalidParams(message: string, data?: unknown): McpError {
-        return this.createError(-32602, `Invalid params: ${message}`, data);
-    }
+    static invalidParams(message: string, data?: unknown): McpError {}
 
     static internalError(message: string, data?: unknown): McpError {
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

27 |         const methodNotFound = McpErrorHandler.methodNotFound('unknownMethod');
28 |         expect(methodNotFound.code).toBe(-32601);
29 |         expect(methodNotFound.message).toBe('Method not found: unknownMethod');

[Killed] UnaryOperator
src/mcp/handlers/errorHandler.ts:20:33
     }
 
     static invalidParams(message: string, data?: unknown): McpError {
-        return this.createError(-32602, `Invalid params: ${message}`, data);
+        return this.createError(+32602, `Invalid params: ${message}`, data);
     }
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:
27 |         const methodNotFound = McpErrorHandler.methodNotFound('unknownMethod');
28 |         expect(methodNotFound.code).toBe(-32601);
29 |         expect(methodNotFound.message).toBe('Method not found: unknownMethod');
30 |

[Killed] StringLiteral
src/mcp/handlers/errorHandler.ts:20:41
     }
 
     static invalidParams(message: string, data?: unknown): McpError {
-        return this.createError(-32602, `Invalid params: ${message}`, data);
+        return this.createError(-32602, ``, data);
     }
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:
28 |         expect(methodNotFound.code).toBe(-32601);
29 |         expect(methodNotFound.message).toBe('Method not found: unknownMethod');
30 | 
31 |         const invalidParams = McpErrorHandler.invalidParams('Bad params');

[Killed] BlockStatement
src/mcp/handlers/errorHandler.ts:23:69
         return this.createError(-32602, `Invalid params: ${message}`, data);
     }
 
-    static internalError(message: string, data?: unknown): McpError {
-        return this.createError(-32603, `Internal error: ${message}`, data);
-    }
+    static internalError(message: string, data?: unknown): McpError {}
 
     static parseError(message: string, data?: unknown): McpError {
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

31 |         const invalidParams = McpErrorHandler.invalidParams('Bad params');
32 |         expect(invalidParams.code).toBe(-32602);
33 |         expect(invalidParams.message).toBe('Invalid params: Bad params');

[Killed] UnaryOperator
src/mcp/handlers/errorHandler.ts:24:33
     }
 
     static internalError(message: string, data?: unknown): McpError {
-        return this.createError(-32603, `Internal error: ${message}`, data);
+        return this.createError(+32603, `Internal error: ${message}`, data);
     }
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

31 |         const invalidParams = McpErrorHandler.invalidParams('Bad params');
32 |         expect(invalidParams.code).toBe(-32602);
33 |         expect(invalidParams.message).toBe('Invalid params: Bad params');

[Killed] StringLiteral
src/mcp/handlers/errorHandler.ts:24:41
     }
 
     static internalError(message: string, data?: unknown): McpError {
-        return this.createError(-32603, `Internal error: ${message}`, data);
+        return this.createError(-32603, ``, data);
     }
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

32 |         expect(invalidParams.code).toBe(-32602);
33 |         expect(invalidParams.message).toBe('Invalid params: Bad params');
34 |

[Killed] BlockStatement
src/mcp/handlers/errorHandler.ts:27:66
         return this.createError(-32603, `Internal error: ${message}`, data);
     }
 
-    static parseError(message: string, data?: unknown): McpError {
-        return this.createError(-32700, `Parse error: ${message}`, data);
-    }
+    static parseError(message: string, data?: unknown): McpError {}
 
     static isMcpError(error: unknown): error is McpError {
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

35 |         const internalError = McpErrorHandler.internalError('Server error');
36 |         expect(internalError.code).toBe(-32603);
37 |         expect(internalError.message).toBe('Internal error: Server error');

[Killed] UnaryOperator
src/mcp/handlers/errorHandler.ts:28:33
     }
 
     static parseError(message: string, data?: unknown): McpError {
-        return this.createError(-32700, `Parse error: ${message}`, data);
+        return this.createError(+32700, `Parse error: ${message}`, data);
     }
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

35 |         const internalError = McpErrorHandler.internalError('Server error');
36 |         expect(internalError.code).toBe(-32603);
37 |         expect(internalError.message).toBe('Internal error: Server error');

[Killed] StringLiteral
src/mcp/handlers/errorHandler.ts:28:41
     }
 
     static parseError(message: string, data?: unknown): McpError {
-        return this.createError(-32700, `Parse error: ${message}`, data);
+        return this.createError(-32700, ``, data);
     }
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:
36 |         expect(internalError.code).toBe(-32603);
37 |         expect(internalError.message).toBe('Internal error: Server error');
38 | 
39 |         const parseError = McpErrorHandler.parseError('JSON error');

[Killed] BlockStatement
src/mcp/handlers/errorHandler.ts:31:58
         return this.createError(-32700, `Parse error: ${message}`, data);
     }
 
-    static isMcpError(error: unknown): error is McpError {
-        return error instanceof Error && 'code' in error;
-    }
+    static isMcpError(error: unknown): error is McpError {}
 
     static handleError(error: unknown): McpError {
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

43 | 
44 |     test('should identify MCP errors', () => {
45 |         const mcpError = McpErrorHandler.invalidRequest('Test');

[Killed] ConditionalExpression
src/mcp/handlers/errorHandler.ts:32:16
     }
 
     static isMcpError(error: unknown): error is McpError {
-        return error instanceof Error && 'code' in error;
+        return true;
     }
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

44 |     test('should identify MCP errors', () => {
45 |         const mcpError = McpErrorHandler.invalidRequest('Test');
46 |         const regularError = new Error('Regular error');

[Killed] LogicalOperator
src/mcp/handlers/errorHandler.ts:32:16
     }
 
     static isMcpError(error: unknown): error is McpError {
-        return error instanceof Error && 'code' in error;
+        return error instanceof Error || 'code' in error;
     }
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

44 |     test('should identify MCP errors', () => {
45 |         const mcpError = McpErrorHandler.invalidRequest('Test');
46 |         const regularError = new Error('Regular error');

[Killed] BlockStatement
src/mcp/handlers/errorHandler.ts:35:50
         return error instanceof Error && 'code' in error;
     }
 
-    static handleError(error: unknown): McpError {
-        if (this.isMcpError(error)) {
-            return error;
-        }
-
-        if (error instanceof Error) {
-            return this.internalError(error.message);
-        }
-
-        if (typeof error === 'string') {
-            return this.internalError(error);
-        }
-
-        return this.internalError('Unknown error occurred');
-    }
+    static handleError(error: unknown): McpError {}
 }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

53 |         const mcpError = McpErrorHandler.invalidRequest('Original');
54 |         const regularError = new Error('Regular');
55 |         const stringError = 'String error';

[Killed] ConditionalExpression
src/mcp/handlers/errorHandler.ts:36:13
     }
 
     static handleError(error: unknown): McpError {
-        if (this.isMcpError(error)) {
+        if (false) {
             return error;
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

53 |         const mcpError = McpErrorHandler.invalidRequest('Original');
54 |         const regularError = new Error('Regular');
55 |         const stringError = 'String error';

[Killed] ConditionalExpression
src/mcp/handlers/errorHandler.ts:36:13
     }
 
     static handleError(error: unknown): McpError {
-        if (this.isMcpError(error)) {
+        if (true) {
             return error;
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

56 |         const unknownError = {type: 'object'};
57 | 
58 |         expect(McpErrorHandler.handleError(mcpError)).toBe(mcpError);

[Killed] ConditionalExpression
src/mcp/handlers/errorHandler.ts:40:13
             return error;
         }
 
-        if (error instanceof Error) {
+        if (false) {
             return this.internalError(error.message);
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:
57 | 
58 |         expect(McpErrorHandler.handleError(mcpError)).toBe(mcpError);
59 | 
60 |         const handledRegular = McpErrorHandler.handleError(regularError);

[Killed] EqualityOperator
src/mcp/handlers/errorHandler.ts:44:13
             return this.internalError(error.message);
         }
 
-        if (typeof error === 'string') {
+        if (typeof error !== 'string') {
             return this.internalError(error);
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:
61 |         expect(handledRegular.code).toBe(-32603);
62 |         expect(handledRegular.message).toBe('Internal error: Regular');
63 | 
64 |         const handledString = McpErrorHandler.handleError(stringError);

[Killed] BlockStatement
src/mcp/handlers/errorHandler.ts:44:40
             return this.internalError(error.message);
         }
 
-        if (typeof error === 'string') {
-            return this.internalError(error);
-        }
+        if (typeof error === 'string') {}
 
         return this.internalError('Unknown error occurred');
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

61 |         expect(handledRegular.code).toBe(-32603);
62 |         expect(handledRegular.message).toBe('Internal error: Regular');
63 |

[Killed] StringLiteral
src/mcp/handlers/errorHandler.ts:48:35
             return this.internalError(error);
         }
 
-        return this.internalError('Unknown error occurred');
+        return this.internalError("");
     }
 }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/errorHandler.test.ts:

65 |         expect(handledString.code).toBe(-32603);
66 |         expect(handledString.message).toBe('Internal error: String error');
67 |
