[Survived] StringLiteral
src/mcp/handlers/toolHandlers.ts:17:13
 // Mock data for now - will be replaced with actual file system implementation
 const mockStandards: Standard[] = [
     {
-        id: 'ts-naming-001',
+        id: "",
         title: 'Use PascalCase for class names',
         category: 'Naming',

[Killed] StringLiteral
src/mcp/handlers/toolHandlers.ts:18:16
 const mockStandards: Standard[] = [
     {
         id: 'ts-naming-001',
-        title: 'Use PascalCase for class names',
+        title: "",
         category: 'Naming',
         technology: 'typescript',
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

12 |             expect(result.totalCount).toBe(2);
13 |             expect(result.cached).toBe(false);
14 |

[Killed] StringLiteral
src/mcp/handlers/toolHandlers.ts:20:21
         id: 'ts-naming-001',
         title: 'Use PascalCase for class names',
         category: 'Naming',
-        technology: 'typescript',
+        technology: "",
         description: 'Class names should follow PascalCase convention',
         rules: [
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:
21 |         test('should filter by technology', async () => {
22 |             const result = await getStandardsHandler.getStandards({
23 |                 technology: 'typescript'
24 |             });

[Survived] StringLiteral
src/mcp/handlers/toolHandlers.ts:24:21
         description: 'Class names should follow PascalCase convention',
         rules: [
             {
-                id: 'ts-naming-001-rule',
+                id: "",
                 description: 'Class names must be PascalCase',
                 severity: 'error',

[Survived] StringLiteral
src/mcp/handlers/toolHandlers.ts:25:30
         rules: [
             {
                 id: 'ts-naming-001-rule',
-                description: 'Class names must be PascalCase',
+                description: "",
                 severity: 'error',
                 category: 'naming'

[Killed] ObjectLiteral
src/mcp/handlers/toolHandlers.ts:32:5
         ],
         lastUpdated: '2025-11-09'
     },
-    {
-        id: 'ts-format-001',
-        title: 'Use semicolons at end of statements',
-        category: 'Formatting',
-        technology: 'typescript',
-        description: 'All statements should end with semicolons',
-        rules: [
-            {
-                id: 'ts-format-001-rule',
-                description: 'Statements must end with semicolon',
-                severity: 'error',
-                category: 'formatting'
-            }
-        ],
-        lastUpdated: '2025-11-09'
-    }
+    {}
 ];
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:
13 |             expect(result.cached).toBe(false);
14 | 
15 |             // Check specific standards exist
16 |             const titles = result.standards.map(s => s.title);

[Killed] StringLiteral
src/mcp/handlers/toolHandlers.ts:36:21
         id: 'ts-format-001',
         title: 'Use semicolons at end of statements',
         category: 'Formatting',
-        technology: 'typescript',
+        technology: "",
         description: 'All statements should end with semicolons',
         rules: [
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:
21 |         test('should filter by technology', async () => {
22 |             const result = await getStandardsHandler.getStandards({
23 |                 technology: 'typescript'
24 |             });

[Survived] ObjectLiteral
src/mcp/handlers/toolHandlers.ts:39:13
         technology: 'typescript',
         description: 'All statements should end with semicolons',
         rules: [
-            {
-                id: 'ts-format-001-rule',
-                description: 'Statements must end with semicolon',
-                severity: 'error',
-                category: 'formatting'
-            }
+            {}
         ],
         lastUpdated: '2025-11-09'

[Survived] StringLiteral
src/mcp/handlers/toolHandlers.ts:42:27
             {
                 id: 'ts-format-001-rule',
                 description: 'Statements must end with semicolon',
-                severity: 'error',
+                severity: "",
                 category: 'formatting'
             }

[Survived] StringLiteral
src/mcp/handlers/toolHandlers.ts:43:27
                 id: 'ts-format-001-rule',
                 description: 'Statements must end with semicolon',
                 severity: 'error',
-                category: 'formatting'
+                category: ""
             }
         ],

[Killed] BlockStatement
src/mcp/handlers/toolHandlers.ts:54:13
     async getStandards(request: GetStandardsRequest): Promise<GetStandardsResponse> {
         this.validateGetStandardsRequest(request);
 
-        try {
-            let filteredStandards = mockStandards;
-
-            if (request.technology) {
-                filteredStandards = filteredStandards.filter(s =>
-                    s.technology.toLowerCase() === request.technology!.toLowerCase()
-                );
-            }
-
-            if (request.category) {
-                filteredStandards = filteredStandards.filter(s =>
-                    s.category.toLowerCase() === request.category!.toLowerCase()
-                );
-            }
-
-            return {
-                standards: filteredStandards,
-                totalCount: filteredStandards.length,
-                responseTime: 0, // Will be set by server
-                cached: false
-            };
-        } catch (error) {
+        try {} catch (error) {
             throw McpErrorHandler.handleError(error);
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

 6 | describe('GetStandardsHandler', () => {
 7 |     describe('getStandards', () => {
 8 |         test('should return all standards when no filters provided', async () => {

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:57:17
         try {
             let filteredStandards = mockStandards;
 
-            if (request.technology) {
+            if (true) {
                 filteredStandards = filteredStandards.filter(s =>
                     s.technology.toLowerCase() === request.technology!.toLowerCase()
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Survived] BlockStatement
src/mcp/handlers/toolHandlers.ts:57:37
         try {
             let filteredStandards = mockStandards;
 
-            if (request.technology) {
-                filteredStandards = filteredStandards.filter(s =>
-                    s.technology.toLowerCase() === request.technology!.toLowerCase()
-                );
-            }
+            if (request.technology) {}
 
             if (request.category) {

[Killed] ArrowFunction
src/mcp/handlers/toolHandlers.ts:58:62
             let filteredStandards = mockStandards;
 
             if (request.technology) {
-                filteredStandards = filteredStandards.filter(s =>
-                    s.technology.toLowerCase() === request.technology!.toLowerCase()
+                filteredStandards = filteredStandards.filter(() => undefined
                 );
             }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

21 |         test('should filter by technology', async () => {
22 |             const result = await getStandardsHandler.getStandards({
23 |                 technology: 'typescript'

[Survived] MethodExpression
src/mcp/handlers/toolHandlers.ts:58:37
             let filteredStandards = mockStandards;
 
             if (request.technology) {
-                filteredStandards = filteredStandards.filter(s =>
-                    s.technology.toLowerCase() === request.technology!.toLowerCase()
-                );
+                filteredStandards = filteredStandards;
             }
 

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:59:21
 
             if (request.technology) {
                 filteredStandards = filteredStandards.filter(s =>
-                    s.technology.toLowerCase() === request.technology!.toLowerCase()
+                    false
                 );
             }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

21 |         test('should filter by technology', async () => {
22 |             const result = await getStandardsHandler.getStandards({
23 |                 technology: 'typescript'

[Killed] EqualityOperator
src/mcp/handlers/toolHandlers.ts:59:21
 
             if (request.technology) {
                 filteredStandards = filteredStandards.filter(s =>
-                    s.technology.toLowerCase() === request.technology!.toLowerCase()
+                    s.technology.toLowerCase() !== request.technology!.toLowerCase()
                 );
             }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

21 |         test('should filter by technology', async () => {
22 |             const result = await getStandardsHandler.getStandards({
23 |                 technology: 'typescript'

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:63:17
                 );
             }
 
-            if (request.category) {
+            if (true) {
                 filteredStandards = filteredStandards.filter(s =>
                     s.category.toLowerCase() === request.category!.toLowerCase()
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:63:17
                 );
             }
 
-            if (request.category) {
+            if (false) {
                 filteredStandards = filteredStandards.filter(s =>
                     s.category.toLowerCase() === request.category!.toLowerCase()
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

35 |         test('should filter by category', async () => {
36 |             const result = await getStandardsHandler.getStandards({
37 |                 category: 'naming'

[Killed] ArrowFunction
src/mcp/handlers/toolHandlers.ts:64:62
             }
 
             if (request.category) {
-                filteredStandards = filteredStandards.filter(s =>
-                    s.category.toLowerCase() === request.category!.toLowerCase()
+                filteredStandards = filteredStandards.filter(() => undefined
                 );
             }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

35 |         test('should filter by category', async () => {
36 |             const result = await getStandardsHandler.getStandards({
37 |                 category: 'naming'

[Killed] MethodExpression
src/mcp/handlers/toolHandlers.ts:64:37
             }
 
             if (request.category) {
-                filteredStandards = filteredStandards.filter(s =>
-                    s.category.toLowerCase() === request.category!.toLowerCase()
-                );
+                filteredStandards = filteredStandards;
             }
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:
35 |         test('should filter by category', async () => {
36 |             const result = await getStandardsHandler.getStandards({
37 |                 category: 'naming'
38 |             });

[Killed] MethodExpression
src/mcp/handlers/toolHandlers.ts:65:50
 
             if (request.category) {
                 filteredStandards = filteredStandards.filter(s =>
-                    s.category.toLowerCase() === request.category!.toLowerCase()
+                    s.category.toLowerCase() === request.category!.toUpperCase()
                 );
             }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

35 |         test('should filter by category', async () => {
36 |             const result = await getStandardsHandler.getStandards({
37 |                 category: 'naming'

[Killed] EqualityOperator
src/mcp/handlers/toolHandlers.ts:65:21
 
             if (request.category) {
                 filteredStandards = filteredStandards.filter(s =>
-                    s.category.toLowerCase() === request.category!.toLowerCase()
+                    s.category.toLowerCase() !== request.category!.toLowerCase()
                 );
             }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

36 |             const result = await getStandardsHandler.getStandards({
37 |                 category: 'naming'
38 |             });

[Killed] ObjectLiteral
src/mcp/handlers/toolHandlers.ts:69:20
                 );
             }
 
-            return {
-                standards: filteredStandards,
-                totalCount: filteredStandards.length,
-                responseTime: 0, // Will be set by server
-                cached: false
-            };
+            return {};
         } catch (error) {
             throw McpErrorHandler.handleError(error);
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

 6 | describe('GetStandardsHandler', () => {
 7 |     describe('getStandards', () => {
 8 |         test('should return all standards when no filters provided', async () => {

[Killed] BooleanLiteral
src/mcp/handlers/toolHandlers.ts:73:25
                 standards: filteredStandards,
                 totalCount: filteredStandards.length,
                 responseTime: 0, // Will be set by server
-                cached: false
+                cached: true
             };
         } catch (error) {
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

 8 |         test('should return all standards when no filters provided', async () => {
 9 |             const result = await getStandardsHandler.getStandards({});
10 |

[Survived] BlockStatement
src/mcp/handlers/toolHandlers.ts:75:25
                 responseTime: 0, // Will be set by server
                 cached: false
             };
-        } catch (error) {
-            throw McpErrorHandler.handleError(error);
-        }
+        } catch (error) {}
     }
 

[Killed] MethodExpression
src/mcp/handlers/toolHandlers.ts:84:27
         this.validateSearchStandardsRequest(request);
 
         try {
-            const query = request.query.toLowerCase();
+            const query = request.query.toUpperCase();
             let results = mockStandards;
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

66 |         test('should search standards by query', async () => {
67 |             const result = await getStandardsHandler.searchStandards({
68 |                 query: 'class'

[Survived] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:87:17
             const query = request.query.toLowerCase();
             let results = mockStandards;
 
-            if (request.technology) {
+            if (false) {
                 results = results.filter(s =>
                     s.technology.toLowerCase() === request.technology!.toLowerCase()

[Killed] ArrowFunction
src/mcp/handlers/toolHandlers.ts:88:42
             let results = mockStandards;
 
             if (request.technology) {
-                results = results.filter(s =>
-                    s.technology.toLowerCase() === request.technology!.toLowerCase()
+                results = results.filter(() => undefined
                 );
             }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

81 |             const result = await getStandardsHandler.searchStandards({
82 |                 query: 'semicolon',
83 |                 technology: 'typescript'

[Survived] MethodExpression
src/mcp/handlers/toolHandlers.ts:88:27
             let results = mockStandards;
 
             if (request.technology) {
-                results = results.filter(s =>
-                    s.technology.toLowerCase() === request.technology!.toLowerCase()
-                );
+                results = results;
             }
 

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:89:21
 
             if (request.technology) {
                 results = results.filter(s =>
-                    s.technology.toLowerCase() === request.technology!.toLowerCase()
+                    false
                 );
             }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

81 |             const result = await getStandardsHandler.searchStandards({
82 |                 query: 'semicolon',
83 |                 technology: 'typescript'

[Killed] MethodExpression
src/mcp/handlers/toolHandlers.ts:89:21
 
             if (request.technology) {
                 results = results.filter(s =>
-                    s.technology.toLowerCase() === request.technology!.toLowerCase()
+                    s.technology.toUpperCase() === request.technology!.toLowerCase()
                 );
             }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

81 |             const result = await getStandardsHandler.searchStandards({
82 |                 query: 'semicolon',
83 |                 technology: 'typescript'

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:93:17
                 );
             }
 
-            if (request.fuzzy !== false) {
+            if (false) {
                 // Simple fuzzy search
                 results = results.filter(s =>
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

66 |         test('should search standards by query', async () => {
67 |             const result = await getStandardsHandler.searchStandards({
68 |                 query: 'class'

[Killed] EqualityOperator
src/mcp/handlers/toolHandlers.ts:93:17
                 );
             }
 
-            if (request.fuzzy !== false) {
+            if (request.fuzzy === false) {
                 // Simple fuzzy search
                 results = results.filter(s =>
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

66 |         test('should search standards by query', async () => {
67 |             const result = await getStandardsHandler.searchStandards({
68 |                 query: 'class'

[Killed] ArrowFunction
src/mcp/handlers/toolHandlers.ts:95:42
 
             if (request.fuzzy !== false) {
                 // Simple fuzzy search
-                results = results.filter(s =>
-                    s.title.toLowerCase().includes(query) ||
-                    s.description.toLowerCase().includes(query) ||
-                    s.category.toLowerCase().includes(query)
+                results = results.filter(() => undefined
                 );
             } else {
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

66 |         test('should search standards by query', async () => {
67 |             const result = await getStandardsHandler.searchStandards({
68 |                 query: 'class'

[Survived] MethodExpression
src/mcp/handlers/toolHandlers.ts:95:27
 
             if (request.fuzzy !== false) {
                 // Simple fuzzy search
-                results = results.filter(s =>
-                    s.title.toLowerCase().includes(query) ||
-                    s.description.toLowerCase().includes(query) ||
-                    s.category.toLowerCase().includes(query)
-                );
+                results = results;
             } else {
                 // Exact match

[Killed] LogicalOperator
src/mcp/handlers/toolHandlers.ts:96:21
             if (request.fuzzy !== false) {
                 // Simple fuzzy search
                 results = results.filter(s =>
-                    s.title.toLowerCase().includes(query) ||
-                    s.description.toLowerCase().includes(query) ||
-                    s.category.toLowerCase().includes(query)
+                    (s.title.toLowerCase().includes(query) || s.description.toLowerCase().includes(query)) && s.category.toLowerCase().includes(query)
                 );
             } else {
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

66 |         test('should search standards by query', async () => {
67 |             const result = await getStandardsHandler.searchStandards({
68 |                 query: 'class'

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:96:21
             if (request.fuzzy !== false) {
                 // Simple fuzzy search
                 results = results.filter(s =>
-                    s.title.toLowerCase().includes(query) ||
-                    s.description.toLowerCase().includes(query) ||
-                    s.category.toLowerCase().includes(query)
+                    false
                 );
             } else {
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:
66 |         test('should search standards by query', async () => {
67 |             const result = await getStandardsHandler.searchStandards({
68 |                 query: 'class'
69 |             });

[Survived] MethodExpression
src/mcp/handlers/toolHandlers.ts:97:21
                 // Simple fuzzy search
                 results = results.filter(s =>
                     s.title.toLowerCase().includes(query) ||
-                    s.description.toLowerCase().includes(query) ||
+                    s.description.toUpperCase().includes(query) ||
                     s.category.toLowerCase().includes(query)
                 );

[Survived] MethodExpression
src/mcp/handlers/toolHandlers.ts:98:21
                 results = results.filter(s =>
                     s.title.toLowerCase().includes(query) ||
                     s.description.toLowerCase().includes(query) ||
-                    s.category.toLowerCase().includes(query)
+                    s.category.toUpperCase().includes(query)
                 );
             } else {

[Survived] BlockStatement
src/mcp/handlers/toolHandlers.ts:100:20
                     s.description.toLowerCase().includes(query) ||
                     s.category.toLowerCase().includes(query)
                 );
-            } else {
-                // Exact match
-                results = results.filter(s =>
-                    s.title.toLowerCase() === query ||
-                    s.description.toLowerCase() === query ||
-                    s.category.toLowerCase() === query
-                );
-            }
+            } else {}
 
             const limit = request.limit || 10;

[Survived] ArrowFunction
src/mcp/handlers/toolHandlers.ts:102:42
                 );
             } else {
                 // Exact match
-                results = results.filter(s =>
-                    s.title.toLowerCase() === query ||
-                    s.description.toLowerCase() === query ||
-                    s.category.toLowerCase() === query
+                results = results.filter(() => undefined
                 );
             }

[Survived] MethodExpression
src/mcp/handlers/toolHandlers.ts:102:27
                 );
             } else {
                 // Exact match
-                results = results.filter(s =>
-                    s.title.toLowerCase() === query ||
-                    s.description.toLowerCase() === query ||
-                    s.category.toLowerCase() === query
-                );
+                results = results;
             }
 

[Survived] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:103:21
             } else {
                 // Exact match
                 results = results.filter(s =>
-                    s.title.toLowerCase() === query ||
-                    s.description.toLowerCase() === query ||
-                    s.category.toLowerCase() === query
+                    true
                 );
             }

[Survived] MethodExpression
src/mcp/handlers/toolHandlers.ts:103:21
             } else {
                 // Exact match
                 results = results.filter(s =>
-                    s.title.toLowerCase() === query ||
+                    s.title.toUpperCase() === query ||
                     s.description.toLowerCase() === query ||
                     s.category.toLowerCase() === query

[Killed] MethodExpression
src/mcp/handlers/toolHandlers.ts:104:21
                 // Exact match
                 results = results.filter(s =>
                     s.title.toLowerCase() === query ||
-                    s.description.toLowerCase() === query ||
+                    s.description.toUpperCase() === query ||
                     s.category.toLowerCase() === query
                 );
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)

Coding Standards MCP Server running on stdio

Coding Standards MCP Server running on stdio


tests/performance/load.test.ts:

[Survived] EqualityOperator
src/mcp/handlers/toolHandlers.ts:104:21
                 // Exact match
                 results = results.filter(s =>
                     s.title.toLowerCase() === query ||
-                    s.description.toLowerCase() === query ||
+                    s.description.toLowerCase() !== query ||
                     s.category.toLowerCase() === query
                 );

[Survived] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:105:21
                 results = results.filter(s =>
                     s.title.toLowerCase() === query ||
                     s.description.toLowerCase() === query ||
-                    s.category.toLowerCase() === query
+                    false
                 );
             }

[Survived] EqualityOperator
src/mcp/handlers/toolHandlers.ts:105:21
                 results = results.filter(s =>
                     s.title.toLowerCase() === query ||
                     s.description.toLowerCase() === query ||
-                    s.category.toLowerCase() === query
+                    s.category.toLowerCase() !== query
                 );
             }

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:109:27
                 );
             }
 
-            const limit = request.limit || 10;
+            const limit = false;
             const limitedResults = results.slice(0, limit);
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:
66 |         test('should search standards by query', async () => {
67 |             const result = await getStandardsHandler.searchStandards({
68 |                 query: 'class'
69 |             });

[Survived] LogicalOperator
src/mcp/handlers/toolHandlers.ts:109:27
                 );
             }
 
-            const limit = request.limit || 10;
+            const limit = request.limit && 10;
             const limitedResults = results.slice(0, limit);
 

[Survived] MethodExpression
src/mcp/handlers/toolHandlers.ts:110:36
             }
 
             const limit = request.limit || 10;
-            const limitedResults = results.slice(0, limit);
+            const limitedResults = results;
 
             return {

[Survived] MethodExpression
src/mcp/handlers/toolHandlers.ts:130:17
             let score = 100;
 
             // Simple validation logic for demonstration
-            if (request.language.toLowerCase() === 'typescript' || request.language.toLowerCase() === 'javascript') {
+            if (request.language.toUpperCase() === 'typescript' || request.language.toLowerCase() === 'javascript') {
                 const lines = request.code.split('\n');
 

[Survived] EqualityOperator
src/mcp/handlers/toolHandlers.ts:130:68
             let score = 100;
 
             // Simple validation logic for demonstration
-            if (request.language.toLowerCase() === 'typescript' || request.language.toLowerCase() === 'javascript') {
+            if (request.language.toLowerCase() === 'typescript' || request.language.toLowerCase() !== 'javascript') {
                 const lines = request.code.split('\n');
 

[Survived] StringLiteral
src/mcp/handlers/toolHandlers.ts:131:50
 
             // Simple validation logic for demonstration
             if (request.language.toLowerCase() === 'typescript' || request.language.toLowerCase() === 'javascript') {
-                const lines = request.code.split('\n');
+                const lines = request.code.split("");
 
                 lines.forEach((line, index) => {

[Survived] MethodExpression
src/mcp/handlers/toolHandlers.ts:135:101
 
                 lines.forEach((line, index) => {
                     // Check for missing semicolons
-                    if (line.trim() && !line.trim().endsWith(';') && !line.trim().endsWith('{') && !line.trim().endsWith('}')) {
+                    if (line.trim() && !line.trim().endsWith(';') && !line.trim().endsWith('{') && !line.endsWith('}')) {
                         violations.push({
                             rule: {
