[Survived] BooleanLiteral
src/mcp/handlers/toolHandlers.ts:135:40
 
                 lines.forEach((line, index) => {
                     // Check for missing semicolons
-                    if (line.trim() && !line.trim().endsWith(';') && !line.trim().endsWith('{') && !line.trim().endsWith('}')) {
+                    if (line.trim() && line.trim().endsWith(';') && !line.trim().endsWith('{') && !line.trim().endsWith('}')) {
                         violations.push({
                             rule: {

[Survived] ObjectLiteral
src/mcp/handlers/toolHandlers.ts:136:41
                 lines.forEach((line, index) => {
                     // Check for missing semicolons
                     if (line.trim() && !line.trim().endsWith(';') && !line.trim().endsWith('{') && !line.trim().endsWith('}')) {
-                        violations.push({
-                            rule: {
-                                id: 'missing-semicolon',
-                                description: 'Statements should end with semicolons',
-                                severity: 'warning',
-                                category: 'formatting'
-                            },
-                            line: index + 1,
-                            column: line.length,
-                            message: 'Missing semicolon at end of statement',
-                            severity: 'warning'
-                        });
+                        violations.push({});
                         score -= 5;
                     }

[Survived] ObjectLiteral
src/mcp/handlers/toolHandlers.ts:137:35
                     // Check for missing semicolons
                     if (line.trim() && !line.trim().endsWith(';') && !line.trim().endsWith('{') && !line.trim().endsWith('}')) {
                         violations.push({
-                            rule: {
-                                id: 'missing-semicolon',
-                                description: 'Statements should end with semicolons',
-                                severity: 'warning',
-                                category: 'formatting'
-                            },
+                            rule: {},
                             line: index + 1,
                             column: line.length,

[Survived] StringLiteral
src/mcp/handlers/toolHandlers.ts:138:37
                     if (line.trim() && !line.trim().endsWith(';') && !line.trim().endsWith('{') && !line.trim().endsWith('}')) {
                         violations.push({
                             rule: {
-                                id: 'missing-semicolon',
+                                id: "",
                                 description: 'Statements should end with semicolons',
                                 severity: 'warning',

[Survived] ArithmeticOperator
src/mcp/handlers/toolHandlers.ts:143:35
                                 severity: 'warning',
                                 category: 'formatting'
                             },
-                            line: index + 1,
+                            line: index - 1,
                             column: line.length,
                             message: 'Missing semicolon at end of statement',

[Survived] StringLiteral
src/mcp/handlers/toolHandlers.ts:145:38
                             },
                             line: index + 1,
                             column: line.length,
-                            message: 'Missing semicolon at end of statement',
+                            message: "",
                             severity: 'warning'
                         });

[Survived] AssignmentOperator
src/mcp/handlers/toolHandlers.ts:148:25
                             message: 'Missing semicolon at end of statement',
                             severity: 'warning'
                         });
-                        score -= 5;
+                        score += 5;
                     }
 

[Survived] Regex
src/mcp/handlers/toolHandlers.ts:152:51
                     }
 
                     // Check for class naming
-                    const classMatch = line.match(/class\s+(\w+)/);
+                    const classMatch = line.match(/class\S+(\w+)/);
                     if (classMatch && !/^[A-Z][a-zA-Z0-9]*$/.test(classMatch[1])) {
                         violations.push({

[Killed] LogicalOperator
src/mcp/handlers/toolHandlers.ts:153:25
 
                     // Check for class naming
                     const classMatch = line.match(/class\s+(\w+)/);
-                    if (classMatch && !/^[A-Z][a-zA-Z0-9]*$/.test(classMatch[1])) {
+                    if (classMatch || !/^[A-Z][a-zA-Z0-9]*$/.test(classMatch[1])) {
                         violations.push({
                             rule: {
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:153:25
 
                     // Check for class naming
                     const classMatch = line.match(/class\s+(\w+)/);
-                    if (classMatch && !/^[A-Z][a-zA-Z0-9]*$/.test(classMatch[1])) {
+                    if (true) {
                         violations.push({
                             rule: {
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Survived] StringLiteral
src/mcp/handlers/toolHandlers.ts:157:46
                         violations.push({
                             rule: {
                                 id: 'class-naming',
-                                description: 'Class names should follow PascalCase',
+                                description: "",
                                 severity: 'error',
                                 category: 'naming'

[Survived] ArithmeticOperator
src/mcp/handlers/toolHandlers.ts:162:37
                                 category: 'naming'
                             },
                             line: index + 1,
-                            column: line.indexOf(classMatch[0]) + 1,
+                            column: line.indexOf(classMatch[0]) - 1,
                             message: `Class name "${classMatch[1]}" should be PascalCase`,
                             severity: 'error'

[Survived] StringLiteral
src/mcp/handlers/toolHandlers.ts:163:38
                             },
                             line: index + 1,
                             column: line.indexOf(classMatch[0]) + 1,
-                            message: `Class name "${classMatch[1]}" should be PascalCase`,
+                            message: ``,
                             severity: 'error'
                         });

[Survived] AssignmentOperator
src/mcp/handlers/toolHandlers.ts:166:25
                             message: `Class name "${classMatch[1]}" should be PascalCase`,
                             severity: 'error'
                         });
-                        score -= 10;
+                        score += 10;
                     }
                 });

[Survived] EqualityOperator
src/mcp/handlers/toolHandlers.ts:172:47
             }
 
             return {
-                valid: violations.filter(v => v.severity === 'error').length === 0,
+                valid: violations.filter(v => v.severity !== 'error').length === 0,
                 violations,
                 score: Math.max(0, score),

[Survived] EqualityOperator
src/mcp/handlers/toolHandlers.ts:172:24
             }
 
             return {
-                valid: violations.filter(v => v.severity === 'error').length === 0,
+                valid: violations.filter(v => v.severity === 'error').length !== 0,
                 violations,
                 score: Math.max(0, score),

[Survived] MethodExpression
src/mcp/handlers/toolHandlers.ts:174:24
             return {
                 valid: violations.filter(v => v.severity === 'error').length === 0,
                 violations,
-                score: Math.max(0, score),
+                score: Math.min(0, score),
                 responseTime: 0 // Will be set by server
             };

[Survived] BlockStatement
src/mcp/handlers/toolHandlers.ts:182:77
         }
     }
 
-    private validateGetStandardsRequest(request: GetStandardsRequest): void {
-        if (request.technology && typeof request.technology !== 'string') {
-            throw McpErrorHandler.invalidParams('technology must be a string');
-        }
-        if (request.category && typeof request.category !== 'string') {
-            throw McpErrorHandler.invalidParams('category must be a string');
-        }
-        if (request.context && typeof request.context !== 'string') {
-            throw McpErrorHandler.invalidParams('context must be a string');
-        }
-        if (request.useCache !== undefined && typeof request.useCache !== 'boolean') {
-            throw McpErrorHandler.invalidParams('useCache must be a boolean');
-        }
-    }
+    private validateGetStandardsRequest(request: GetStandardsRequest): void {}
 
     private validateSearchStandardsRequest(request: SearchStandardsRequest): void {

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:183:13
     }
 
     private validateGetStandardsRequest(request: GetStandardsRequest): void {
-        if (request.technology && typeof request.technology !== 'string') {
+        if (true) {
             throw McpErrorHandler.invalidParams('technology must be a string');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:183:35
     }
 
     private validateGetStandardsRequest(request: GetStandardsRequest): void {
-        if (request.technology && typeof request.technology !== 'string') {
+        if (request.technology && true) {
             throw McpErrorHandler.invalidParams('technology must be a string');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Survived] StringLiteral
src/mcp/handlers/toolHandlers.ts:184:49
 
     private validateGetStandardsRequest(request: GetStandardsRequest): void {
         if (request.technology && typeof request.technology !== 'string') {
-            throw McpErrorHandler.invalidParams('technology must be a string');
+            throw McpErrorHandler.invalidParams("");
         }
         if (request.category && typeof request.category !== 'string') {

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:186:13
         if (request.technology && typeof request.technology !== 'string') {
             throw McpErrorHandler.invalidParams('technology must be a string');
         }
-        if (request.category && typeof request.category !== 'string') {
+        if (true) {
             throw McpErrorHandler.invalidParams('category must be a string');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] EqualityOperator
src/mcp/handlers/toolHandlers.ts:186:33
         if (request.technology && typeof request.technology !== 'string') {
             throw McpErrorHandler.invalidParams('technology must be a string');
         }
-        if (request.category && typeof request.category !== 'string') {
+        if (request.category && typeof request.category === 'string') {
             throw McpErrorHandler.invalidParams('category must be a string');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:
50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}
53 |     } else {

[Killed] LogicalOperator
src/mcp/handlers/toolHandlers.ts:189:13
         if (request.category && typeof request.category !== 'string') {
             throw McpErrorHandler.invalidParams('category must be a string');
         }
-        if (request.context && typeof request.context !== 'string') {
+        if (request.context || typeof request.context !== 'string') {
             throw McpErrorHandler.invalidParams('context must be a string');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:189:13
         if (request.category && typeof request.category !== 'string') {
             throw McpErrorHandler.invalidParams('category must be a string');
         }
-        if (request.context && typeof request.context !== 'string') {
+        if (true) {
             throw McpErrorHandler.invalidParams('context must be a string');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] LogicalOperator
src/mcp/handlers/toolHandlers.ts:192:13
         if (request.context && typeof request.context !== 'string') {
             throw McpErrorHandler.invalidParams('context must be a string');
         }
-        if (request.useCache !== undefined && typeof request.useCache !== 'boolean') {
+        if (request.useCache !== undefined || typeof request.useCache !== 'boolean') {
             throw McpErrorHandler.invalidParams('useCache must be a boolean');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] EqualityOperator
src/mcp/handlers/toolHandlers.ts:192:13
         if (request.context && typeof request.context !== 'string') {
             throw McpErrorHandler.invalidParams('context must be a string');
         }
-        if (request.useCache !== undefined && typeof request.useCache !== 'boolean') {
+        if (request.useCache === undefined && typeof request.useCache !== 'boolean') {
             throw McpErrorHandler.invalidParams('useCache must be a boolean');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Survived] StringLiteral
src/mcp/handlers/toolHandlers.ts:193:49
             throw McpErrorHandler.invalidParams('context must be a string');
         }
         if (request.useCache !== undefined && typeof request.useCache !== 'boolean') {
-            throw McpErrorHandler.invalidParams('useCache must be a boolean');
+            throw McpErrorHandler.invalidParams("");
         }
     }

[Survived] BlockStatement
src/mcp/handlers/toolHandlers.ts:197:83
         }
     }
 
-    private validateSearchStandardsRequest(request: SearchStandardsRequest): void {
-        if (!request.query || typeof request.query !== 'string') {
-            throw McpErrorHandler.invalidParams('query is required and must be a string');
-        }
-        if (request.technology && typeof request.technology !== 'string') {
-            throw McpErrorHandler.invalidParams('technology must be a string');
-        }
-        if (request.fuzzy !== undefined && typeof request.fuzzy !== 'boolean') {
-            throw McpErrorHandler.invalidParams('fuzzy must be a boolean');
-        }
-        if (request.limit !== undefined && (typeof request.limit !== 'number' || request.limit < 1)) {
-            throw McpErrorHandler.invalidParams('limit must be a positive number');
-        }
-    }
+    private validateSearchStandardsRequest(request: SearchStandardsRequest): void {}
 
     private validateValidateCodeRequest(request: ValidateCodeRequest): void {

[Killed] BooleanLiteral
src/mcp/handlers/toolHandlers.ts:198:13
     }
 
     private validateSearchStandardsRequest(request: SearchStandardsRequest): void {
-        if (!request.query || typeof request.query !== 'string') {
+        if (request.query || typeof request.query !== 'string') {
             throw McpErrorHandler.invalidParams('query is required and must be a string');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:198:13
     }
 
     private validateSearchStandardsRequest(request: SearchStandardsRequest): void {
-        if (!request.query || typeof request.query !== 'string') {
+        if (true) {
             throw McpErrorHandler.invalidParams('query is required and must be a string');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] LogicalOperator
src/mcp/handlers/toolHandlers.ts:201:13
         if (!request.query || typeof request.query !== 'string') {
             throw McpErrorHandler.invalidParams('query is required and must be a string');
         }
-        if (request.technology && typeof request.technology !== 'string') {
+        if (request.technology || typeof request.technology !== 'string') {
             throw McpErrorHandler.invalidParams('technology must be a string');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:201:35
         if (!request.query || typeof request.query !== 'string') {
             throw McpErrorHandler.invalidParams('query is required and must be a string');
         }
-        if (request.technology && typeof request.technology !== 'string') {
+        if (request.technology && true) {
             throw McpErrorHandler.invalidParams('technology must be a string');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:204:13
         if (request.technology && typeof request.technology !== 'string') {
             throw McpErrorHandler.invalidParams('technology must be a string');
         }
-        if (request.fuzzy !== undefined && typeof request.fuzzy !== 'boolean') {
+        if (true) {
             throw McpErrorHandler.invalidParams('fuzzy must be a boolean');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:204:13
         if (request.technology && typeof request.technology !== 'string') {
             throw McpErrorHandler.invalidParams('technology must be a string');
         }
-        if (request.fuzzy !== undefined && typeof request.fuzzy !== 'boolean') {
+        if (true && typeof request.fuzzy !== 'boolean') {
             throw McpErrorHandler.invalidParams('fuzzy must be a boolean');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] EqualityOperator
src/mcp/handlers/toolHandlers.ts:207:13
         if (request.fuzzy !== undefined && typeof request.fuzzy !== 'boolean') {
             throw McpErrorHandler.invalidParams('fuzzy must be a boolean');
         }
-        if (request.limit !== undefined && (typeof request.limit !== 'number' || request.limit < 1)) {
+        if (request.limit === undefined && (typeof request.limit !== 'number' || request.limit < 1)) {
             throw McpErrorHandler.invalidParams('limit must be a positive number');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] EqualityOperator
src/mcp/handlers/toolHandlers.ts:207:45
         if (request.fuzzy !== undefined && typeof request.fuzzy !== 'boolean') {
             throw McpErrorHandler.invalidParams('fuzzy must be a boolean');
         }
-        if (request.limit !== undefined && (typeof request.limit !== 'number' || request.limit < 1)) {
+        if (request.limit !== undefined && (typeof request.limit === 'number' || request.limit < 1)) {
             throw McpErrorHandler.invalidParams('limit must be a positive number');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Survived] StringLiteral
src/mcp/handlers/toolHandlers.ts:208:49
             throw McpErrorHandler.invalidParams('fuzzy must be a boolean');
         }
         if (request.limit !== undefined && (typeof request.limit !== 'number' || request.limit < 1)) {
-            throw McpErrorHandler.invalidParams('limit must be a positive number');
+            throw McpErrorHandler.invalidParams("");
         }
     }

[Survived] BlockStatement
src/mcp/handlers/toolHandlers.ts:212:77
         }
     }
 
-    private validateValidateCodeRequest(request: ValidateCodeRequest): void {
-        if (!request.code || typeof request.code !== 'string') {
-            throw McpErrorHandler.invalidParams('code is required and must be a string');
-        }
-        if (!request.language || typeof request.language !== 'string') {
-            throw McpErrorHandler.invalidParams('language is required and must be a string');
-        }
-        if (request.useStrict !== undefined && typeof request.useStrict !== 'boolean') {
-            throw McpErrorHandler.invalidParams('useStrict must be a boolean');
-        }
-        if (request.rules && (!Array.isArray(request.rules) || request.rules.some(r => typeof r !== 'string'))) {
-            throw McpErrorHandler.invalidParams('rules must be an array of strings');
-        }
-    }
+    private validateValidateCodeRequest(request: ValidateCodeRequest): void {}
 }
 

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:213:13
     }
 
     private validateValidateCodeRequest(request: ValidateCodeRequest): void {
-        if (!request.code || typeof request.code !== 'string') {
+        if (true) {
             throw McpErrorHandler.invalidParams('code is required and must be a string');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] BooleanLiteral
src/mcp/handlers/toolHandlers.ts:213:13
     }
 
     private validateValidateCodeRequest(request: ValidateCodeRequest): void {
-        if (!request.code || typeof request.code !== 'string') {
+        if (request.code || typeof request.code !== 'string') {
             throw McpErrorHandler.invalidParams('code is required and must be a string');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:216:13
         if (!request.code || typeof request.code !== 'string') {
             throw McpErrorHandler.invalidParams('code is required and must be a string');
         }
-        if (!request.language || typeof request.language !== 'string') {
+        if (true) {
             throw McpErrorHandler.invalidParams('language is required and must be a string');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] EqualityOperator
src/mcp/handlers/toolHandlers.ts:216:34
         if (!request.code || typeof request.code !== 'string') {
             throw McpErrorHandler.invalidParams('code is required and must be a string');
         }
-        if (!request.language || typeof request.language !== 'string') {
+        if (!request.language || typeof request.language === 'string') {
             throw McpErrorHandler.invalidParams('language is required and must be a string');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] EqualityOperator
src/mcp/handlers/toolHandlers.ts:219:13
         if (!request.language || typeof request.language !== 'string') {
             throw McpErrorHandler.invalidParams('language is required and must be a string');
         }
-        if (request.useStrict !== undefined && typeof request.useStrict !== 'boolean') {
+        if (request.useStrict === undefined && typeof request.useStrict !== 'boolean') {
             throw McpErrorHandler.invalidParams('useStrict must be a boolean');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] EqualityOperator
src/mcp/handlers/toolHandlers.ts:219:48
         if (!request.language || typeof request.language !== 'string') {
             throw McpErrorHandler.invalidParams('language is required and must be a string');
         }
-        if (request.useStrict !== undefined && typeof request.useStrict !== 'boolean') {
+        if (request.useStrict !== undefined && typeof request.useStrict === 'boolean') {
             throw McpErrorHandler.invalidParams('useStrict must be a boolean');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

166 |                     code: 'test',
167 |                     language: 'typescript',
168 |                     useStrict: true,

[Survived] StringLiteral
src/mcp/handlers/toolHandlers.ts:220:49
             throw McpErrorHandler.invalidParams('language is required and must be a string');
         }
         if (request.useStrict !== undefined && typeof request.useStrict !== 'boolean') {
-            throw McpErrorHandler.invalidParams('useStrict must be a boolean');
+            throw McpErrorHandler.invalidParams("");
         }
         if (request.rules && (!Array.isArray(request.rules) || request.rules.some(r => typeof r !== 'string'))) {

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:222:13
         if (request.useStrict !== undefined && typeof request.useStrict !== 'boolean') {
             throw McpErrorHandler.invalidParams('useStrict must be a boolean');
         }
-        if (request.rules && (!Array.isArray(request.rules) || request.rules.some(r => typeof r !== 'string'))) {
+        if (true) {
             throw McpErrorHandler.invalidParams('rules must be an array of strings');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

50 |   static createError(code: number, message: string, data?: unknown): McpError {
51 |     if (stryMutAct_9fa48("0")) {
52 |       {}

[Killed] ConditionalExpression
src/mcp/handlers/toolHandlers.ts:222:88
         if (request.useStrict !== undefined && typeof request.useStrict !== 'boolean') {
             throw McpErrorHandler.invalidParams('useStrict must be a boolean');
         }
-        if (request.rules && (!Array.isArray(request.rules) || request.rules.some(r => typeof r !== 'string'))) {
+        if (request.rules && (!Array.isArray(request.rules) || request.rules.some(r => true))) {
             throw McpErrorHandler.invalidParams('rules must be an array of strings');
         }
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/toolHandlers.test.ts:

166 |                     code: 'test',
167 |                     language: 'typescript',
168 |                     useStrict: true,
