[Survived] BlockStatement
src/mcp/server.ts:28:19
     private server: Server;
     private startTime: number;
 
-    constructor() {
-        this.startTime = performance.now();
-        this.server = new Server(
-            {
-                name: 'coding-standards-server',
-                version: '1.0.0',
-            },
-            {
-                capabilities: {
-                    tools: {},
-                },
-            }
-        );
-
-        this.setupHandlers();
-    }
+    constructor() {}
 
     private setupHandlers(): void {

[Survived] ObjectLiteral
src/mcp/server.ts:31:13
     constructor() {
         this.startTime = performance.now();
         this.server = new Server(
-            {
-                name: 'coding-standards-server',
-                version: '1.0.0',
-            },
+            {},
             {
                 capabilities: {

[Survived] StringLiteral
src/mcp/server.ts:33:26
         this.server = new Server(
             {
                 name: 'coding-standards-server',
-                version: '1.0.0',
+                version: "",
             },
             {

[Killed] ObjectLiteral
src/mcp/server.ts:35:13
                 name: 'coding-standards-server',
                 version: '1.0.0',
             },
-            {
-                capabilities: {
-                    tools: {},
-                },
-            }
+            {}
         );
 
killedBy: All tests
statusReason: bun test v1.3.1 (89fa0f34)


tests/unit/server.test.ts:

110 |                     throw new Error(`Server does not support resources (required for ${method})`);
111 |                 }
112 |                 break;

[Survived] BlockStatement
src/mcp/server.ts:47:75
 
     private setupHandlers(): void {
         // List available tools
-        this.server.setRequestHandler(ListToolsRequestSchema, async () => {
-            return {
-                tools: [
-                    GET_STANDARDS_TOOL,
-                    SEARCH_STANDARDS_TOOL,
-                    VALIDATE_CODE_TOOL,
-                ],
-            };
-        });
+        this.server.setRequestHandler(ListToolsRequestSchema, async () => {});
 
         // Handle tool calls

[Survived] BlockStatement
src/mcp/server.ts:61:17
         this.server.setRequestHandler(CallToolRequestSchema, async (request) => {
             const startTime = performance.now();
 
-            try {
-                const {name, arguments: args} = request.params;
-
-                switch (name) {
-                    case 'getStandards':
-                        return await this.handleGetStandards(args as GetStandardsRequest, startTime);
-
-                    case 'searchStandards':
-                        return await this.handleSearchStandards(args as SearchStandardsRequest, startTime);
-
-                    case 'validateCode':
-                        return await this.handleValidateCode(args as ValidateCodeRequest, startTime);
-
-                    default:
-                        throw McpErrorHandler.methodNotFound(name);
-                }
-            } catch (error) {
+            try {} catch (error) {
                 const mcpError = McpErrorHandler.handleError(error);
                 throw new McpError(

[Survived] ConditionalExpression
src/mcp/server.ts:65:21
                 const {name, arguments: args} = request.params;
 
                 switch (name) {
-                    case 'getStandards':
-                        return await this.handleGetStandards(args as GetStandardsRequest, startTime);
+                    case 'getStandards':
 
                     case 'searchStandards':

[Survived] StringLiteral
src/mcp/server.ts:65:26
                 const {name, arguments: args} = request.params;
 
                 switch (name) {
-                    case 'getStandards':
+                    case "":
                         return await this.handleGetStandards(args as GetStandardsRequest, startTime);
 

[Survived] ConditionalExpression
src/mcp/server.ts:68:21
                     case 'getStandards':
                         return await this.handleGetStandards(args as GetStandardsRequest, startTime);
 
-                    case 'searchStandards':
-                        return await this.handleSearchStandards(args as SearchStandardsRequest, startTime);
+                    case 'searchStandards':
 
                     case 'validateCode':

[Survived] ConditionalExpression
src/mcp/server.ts:71:21
                     case 'searchStandards':
                         return await this.handleSearchStandards(args as SearchStandardsRequest, startTime);
 
-                    case 'validateCode':
-                        return await this.handleValidateCode(args as ValidateCodeRequest, startTime);
+                    case 'validateCode':
 
                     default:

[Survived] ConditionalExpression
src/mcp/server.ts:74:21
                     case 'validateCode':
                         return await this.handleValidateCode(args as ValidateCodeRequest, startTime);
 
-                    default:
-                        throw McpErrorHandler.methodNotFound(name);
+                    default:
                 }
             } catch (error) {

[Survived] BlockStatement
src/mcp/server.ts:77:29
                     default:
                         throw McpErrorHandler.methodNotFound(name);
                 }
-            } catch (error) {
-                const mcpError = McpErrorHandler.handleError(error);
-                throw new McpError(
-                    ErrorCode.InternalError,
-                    `Tool execution failed: ${mcpError.message}`,
-                    mcpError.data
-                );
-            }
+            } catch (error) {}
         });
     }

[Survived] StringLiteral
src/mcp/server.ts:81:21
                 const mcpError = McpErrorHandler.handleError(error);
                 throw new McpError(
                     ErrorCode.InternalError,
-                    `Tool execution failed: ${mcpError.message}`,
+                    ``,
                     mcpError.data
                 );

[Survived] BlockStatement
src/mcp/server.ts:88:87
         });
     }
 
-    private async handleGetStandards(request: GetStandardsRequest, startTime: number) {
-        const metrics = await this.executeWithMetrics(
-            () => getStandardsHandler.getStandards(request)
-        );
-
-        return {
-            content: [
-                {
-                    type: 'text',
-                    text: JSON.stringify({
-                        standards: metrics.result.standards,
-                        totalCount: metrics.result.totalCount,
-                        responseTime: metrics.responseTime,
-                        cached: metrics.result.cached || false,
-                        serverMetrics: {
-                            startupTime: this.startTime,
-                            memoryUsage: process.memoryUsage().heapUsed / 1024 / 1024, // MB
-                            timestamp: new Date().toISOString()
-                        }
-                    }, null, 2)
-                }
-            ]
-        };
-    }
+    private async handleGetStandards(request: GetStandardsRequest, startTime: number) {}
 
     private async handleSearchStandards(request: SearchStandardsRequest, startTime: number) {

[Survived] ArrowFunction
src/mcp/server.ts:90:13
 
     private async handleGetStandards(request: GetStandardsRequest, startTime: number) {
         const metrics = await this.executeWithMetrics(
-            () => getStandardsHandler.getStandards(request)
+            () => undefined
         );
 

[Survived] ObjectLiteral
src/mcp/server.ts:95:17
 
         return {
             content: [
-                {
-                    type: 'text',
-                    text: JSON.stringify({
-                        standards: metrics.result.standards,
-                        totalCount: metrics.result.totalCount,
-                        responseTime: metrics.responseTime,
-                        cached: metrics.result.cached || false,
-                        serverMetrics: {
-                            startupTime: this.startTime,
-                            memoryUsage: process.memoryUsage().heapUsed / 1024 / 1024, // MB
-                            timestamp: new Date().toISOString()
-                        }
-                    }, null, 2)
-                }
+                {}
             ]
         };

[Survived] ConditionalExpression
src/mcp/server.ts:101:33
                         standards: metrics.result.standards,
                         totalCount: metrics.result.totalCount,
                         responseTime: metrics.responseTime,
-                        cached: metrics.result.cached || false,
+                        cached: true,
                         serverMetrics: {
                             startupTime: this.startTime,

[Survived] BooleanLiteral
src/mcp/server.ts:101:58
                         standards: metrics.result.standards,
                         totalCount: metrics.result.totalCount,
                         responseTime: metrics.responseTime,
-                        cached: metrics.result.cached || false,
+                        cached: metrics.result.cached || true,
                         serverMetrics: {
                             startupTime: this.startTime,

[Survived] ArithmeticOperator
src/mcp/server.ts:104:42
                         cached: metrics.result.cached || false,
                         serverMetrics: {
                             startupTime: this.startTime,
-                            memoryUsage: process.memoryUsage().heapUsed / 1024 / 1024, // MB
+                            memoryUsage: process.memoryUsage().heapUsed * 1024 / 1024, // MB
                             timestamp: new Date().toISOString()
                         }

[Survived] ArithmeticOperator
src/mcp/server.ts:104:42
                         cached: metrics.result.cached || false,
                         serverMetrics: {
                             startupTime: this.startTime,
-                            memoryUsage: process.memoryUsage().heapUsed / 1024 / 1024, // MB
+                            memoryUsage: process.memoryUsage().heapUsed / 1024 * 1024, // MB
                             timestamp: new Date().toISOString()
                         }

[Survived] BlockStatement
src/mcp/server.ts:113:93
         };
     }
 
-    private async handleSearchStandards(request: SearchStandardsRequest, startTime: number) {
-        const metrics = await this.executeWithMetrics(
-            () => getStandardsHandler.searchStandards(request)
-        );
-
-        return {
-            content: [
-                {
-                    type: 'text',
-                    text: JSON.stringify({
-                        results: metrics.result.results,
-                        totalCount: metrics.result.totalCount,
-                        responseTime: metrics.responseTime,
-                        serverMetrics: {
-                            startupTime: this.startTime,
-                            memoryUsage: process.memoryUsage().heapUsed / 1024 / 1024, // MB
-                            timestamp: new Date().toISOString()
-                        }
-                    }, null, 2)
-                }
-            ]
-        };
-    }
+    private async handleSearchStandards(request: SearchStandardsRequest, startTime: number) {}
 
     private async handleValidateCode(request: ValidateCodeRequest, startTime: number) {

[Survived] ArrowFunction
src/mcp/server.ts:115:13
 
     private async handleSearchStandards(request: SearchStandardsRequest, startTime: number) {
         const metrics = await this.executeWithMetrics(
-            () => getStandardsHandler.searchStandards(request)
+            () => undefined
         );
 

[Survived] ArrayDeclaration
src/mcp/server.ts:119:22
         );
 
         return {
-            content: [
-                {
-                    type: 'text',
-                    text: JSON.stringify({
-                        results: metrics.result.results,
-                        totalCount: metrics.result.totalCount,
-                        responseTime: metrics.responseTime,
-                        serverMetrics: {
-                            startupTime: this.startTime,
-                            memoryUsage: process.memoryUsage().heapUsed / 1024 / 1024, // MB
-                            timestamp: new Date().toISOString()
-                        }
-                    }, null, 2)
-                }
-            ]
+            content: []
         };
     }

[Survived] ObjectLiteral
src/mcp/server.ts:122:42
             content: [
                 {
                     type: 'text',
-                    text: JSON.stringify({
-                        results: metrics.result.results,
-                        totalCount: metrics.result.totalCount,
-                        responseTime: metrics.responseTime,
-                        serverMetrics: {
-                            startupTime: this.startTime,
-                            memoryUsage: process.memoryUsage().heapUsed / 1024 / 1024, // MB
-                            timestamp: new Date().toISOString()
-                        }
-                    }, null, 2)
+                    text: JSON.stringify({}, null, 2)
                 }
             ]

[Survived] BlockStatement
src/mcp/server.ts:137:87
         };
     }
 
-    private async handleValidateCode(request: ValidateCodeRequest, startTime: number) {
-        const metrics = await this.executeWithMetrics(
-            () => getStandardsHandler.validateCode(request)
-        );
-
-        return {
-            content: [
-                {
-                    type: 'text',
-                    text: JSON.stringify({
-                        valid: metrics.result.valid,
-                        violations: metrics.result.violations,
-                        score: metrics.result.score,
-                        responseTime: metrics.responseTime,
-                        serverMetrics: {
-                            startupTime: this.startTime,
-                            memoryUsage: process.memoryUsage().heapUsed / 1024 / 1024, // MB
-                            timestamp: new Date().toISOString()
-                        }
-                    }, null, 2)
-                }
-            ]
-        };
-    }
+    private async handleValidateCode(request: ValidateCodeRequest, startTime: number) {}
 
     private async executeWithMetrics<T>(operation: () => Promise<T>): Promise<{ result: T; responseTime: number }> {

[Survived] ArrowFunction
src/mcp/server.ts:139:13
 
     private async handleValidateCode(request: ValidateCodeRequest, startTime: number) {
         const metrics = await this.executeWithMetrics(
-            () => getStandardsHandler.validateCode(request)
+            () => undefined
         );
 

[Survived] ArrayDeclaration
src/mcp/server.ts:143:22
         );
 
         return {
-            content: [
-                {
-                    type: 'text',
-                    text: JSON.stringify({
-                        valid: metrics.result.valid,
-                        violations: metrics.result.violations,
-                        score: metrics.result.score,
-                        responseTime: metrics.responseTime,
-                        serverMetrics: {
-                            startupTime: this.startTime,
-                            memoryUsage: process.memoryUsage().heapUsed / 1024 / 1024, // MB
-                            timestamp: new Date().toISOString()
-                        }
-                    }, null, 2)
-                }
-            ]
+            content: []
         };
     }

[Survived] BlockStatement
src/mcp/server.ts:162:116
         };
     }
 
-    private async executeWithMetrics<T>(operation: () => Promise<T>): Promise<{ result: T; responseTime: number }> {
-        const startTime = performance.now();
-        const result = await operation();
-        const responseTime = performance.now() - startTime;
-
-        return {result, responseTime};
-    }
+    private async executeWithMetrics<T>(operation: () => Promise<T>): Promise<{ result: T; responseTime: number }> {}
 
     private validateRequest(request: unknown): void {

[Survived] ArithmeticOperator
src/mcp/server.ts:165:30
     private async executeWithMetrics<T>(operation: () => Promise<T>): Promise<{ result: T; responseTime: number }> {
         const startTime = performance.now();
         const result = await operation();
-        const responseTime = performance.now() - startTime;
+        const responseTime = performance.now() + startTime;
 
         return {result, responseTime};

[Survived] BlockStatement
src/mcp/server.ts:170:53
         return {result, responseTime};
     }
 
-    private validateRequest(request: unknown): void {
-        if (!request || typeof request !== 'object') {
-            throw McpErrorHandler.invalidRequest('Request must be an object');
-        }
-    }
+    private validateRequest(request: unknown): void {}
 
     async run(): Promise<void> {

[Survived] ConditionalExpression
src/mcp/server.ts:171:25
     }
 
     private validateRequest(request: unknown): void {
-        if (!request || typeof request !== 'object') {
+        if (!request || false) {
             throw McpErrorHandler.invalidRequest('Request must be an object');
         }

[Survived] BlockStatement
src/mcp/server.ts:171:54
     }
 
     private validateRequest(request: unknown): void {
-        if (!request || typeof request !== 'object') {
-            throw McpErrorHandler.invalidRequest('Request must be an object');
-        }
+        if (!request || typeof request !== 'object') {}
     }
 

[Survived] StringLiteral
src/mcp/server.ts:172:50
 
     private validateRequest(request: unknown): void {
         if (!request || typeof request !== 'object') {
-            throw McpErrorHandler.invalidRequest('Request must be an object');
+            throw McpErrorHandler.invalidRequest("");
         }
     }

[Survived] BlockStatement
src/mcp/server.ts:176:32
         }
     }
 
-    async run(): Promise<void> {
-        const transport = new StdioServerTransport();
-        await this.server.connect(transport);
-        console.error('Coding Standards MCP Server running on stdio');
-    }
+    async run(): Promise<void> {}
 }
 

[Survived] ConditionalExpression
src/mcp/server.ts:184:5
 }
 
 // Start server if this file is run directly
-if (import.meta.main) {
+if (false) {
     const server = new CodingStandardsServer();
     server.run().catch((error) => {

[Survived] ConditionalExpression
src/mcp/server.ts:184:5
 }
 
 // Start server if this file is run directly
-if (import.meta.main) {
+if (true) {
     const server = new CodingStandardsServer();
     server.run().catch((error) => {

[Survived] BlockStatement
src/mcp/server.ts:186:35
 // Start server if this file is run directly
 if (import.meta.main) {
     const server = new CodingStandardsServer();
-    server.run().catch((error) => {
-        console.error('Server failed to start:', error);
-        process.exit(1);
-    });
+    server.run().catch((error) => {});
 }
 
