[Survived] StringLiteral
src/mcp/start-server.ts:7:19
 
 const server = new CodingStandardsServer();
 server.run().catch((error) => {
-    console.error('Server failed to start:', error);
+    console.error("", error);
     process.exit(1);
 });
