[Survived] StringLiteral
src/types/mcp.ts:82:11
 }
 
 export const GET_STANDARDS_TOOL: Tool = {
-    name: 'getStandards',
+    name: "",
     description: 'Retrieve coding standards for specified technology and category',
     inputSchema: {

[Survived] StringLiteral
src/types/mcp.ts:83:18
 
 export const GET_STANDARDS_TOOL: Tool = {
     name: 'getStandards',
-    description: 'Retrieve coding standards for specified technology and category',
+    description: "",
     inputSchema: {
         type: 'object',

[Survived] StringLiteral
src/types/mcp.ts:89:30
         properties: {
             technology: {
                 type: 'string',
-                description: 'The technology to get standards for (e.g., typescript, javascript, python)'
+                description: ""
             },
             category: {

[Survived] StringLiteral
src/types/mcp.ts:93:30
             },
             category: {
                 type: 'string',
-                description: 'The category of standards (e.g., naming, formatting, best-practices)'
+                description: ""
             },
             context: {

[Survived] ObjectLiteral
src/types/mcp.ts:95:22
                 type: 'string',
                 description: 'The category of standards (e.g., naming, formatting, best-practices)'
             },
-            context: {
-                type: 'string',
-                description: 'Additional context to help find relevant standards'
-            },
+            context: {},
             useCache: {
                 type: 'boolean',

[Survived] StringLiteral
src/types/mcp.ts:97:30
             },
             context: {
                 type: 'string',
-                description: 'Additional context to help find relevant standards'
+                description: ""
             },
             useCache: {

[Survived] StringLiteral
src/types/mcp.ts:101:30
             },
             useCache: {
                 type: 'boolean',
-                description: 'Whether to use cached results (default: true)',
+                description: "",
                 default: true
             }

[Survived] BooleanLiteral
src/types/mcp.ts:102:26
             useCache: {
                 type: 'boolean',
                 description: 'Whether to use cached results (default: true)',
-                default: true
+                default: false
             }
         }

[Survived] StringLiteral
src/types/mcp.ts:119:23
                 description: 'Search query to find relevant standards'
             },
             technology: {
-                type: 'string',
+                type: "",
                 description: 'Filter by technology'
             },

[Survived] ObjectLiteral
src/types/mcp.ts:122:20
                 type: 'string',
                 description: 'Filter by technology'
             },
-            fuzzy: {
-                type: 'boolean',
-                description: 'Enable fuzzy matching (default: true)',
-                default: true
-            },
+            fuzzy: {},
             limit: {
                 type: 'number',

[Survived] StringLiteral
src/types/mcp.ts:124:30
             },
             fuzzy: {
                 type: 'boolean',
-                description: 'Enable fuzzy matching (default: true)',
+                description: "",
                 default: true
             },

[Survived] BooleanLiteral
src/types/mcp.ts:125:26
             fuzzy: {
                 type: 'boolean',
                 description: 'Enable fuzzy matching (default: true)',
-                default: true
+                default: false
             },
             limit: {

[Survived] StringLiteral
src/types/mcp.ts:133:20
                 default: 10
             }
         },
-        required: ['query']
+        required: [""]
     }
 };

[Survived] StringLiteral
src/types/mcp.ts:139:18
 
 export const VALIDATE_CODE_TOOL: Tool = {
     name: 'validateCode',
-    description: 'Validate code against coding standards',
+    description: "",
     inputSchema: {
         type: 'object',

[Survived] StringLiteral
src/types/mcp.ts:145:30
         properties: {
             code: {
                 type: 'string',
-                description: 'The code to validate'
+                description: ""
             },
             language: {

[Survived] ObjectLiteral
src/types/mcp.ts:147:23
                 type: 'string',
                 description: 'The code to validate'
             },
-            language: {
-                type: 'string',
-                description: 'Programming language of the code'
-            },
+            language: {},
             useStrict: {
                 type: 'boolean',

[Survived] StringLiteral
src/types/mcp.ts:153:30
             },
             useStrict: {
                 type: 'boolean',
-                description: 'Apply strict validation (default: false)',
+                description: "",
                 default: false
             },

[Survived] BooleanLiteral
src/types/mcp.ts:154:26
             useStrict: {
                 type: 'boolean',
                 description: 'Apply strict validation (default: false)',
-                default: false
+                default: true
             },
             rules: {

[Survived] ObjectLiteral
src/types/mcp.ts:156:20
                 description: 'Apply strict validation (default: false)',
                 default: false
             },
-            rules: {
-                type: 'array',
-                items: {
-                    type: 'string'
-                },
-                description: 'Specific rules to apply (optional)'
-            }
+            rules: {}
         },
         required: ['code', 'language']

[Survived] StringLiteral
src/types/mcp.ts:159:27
             rules: {
                 type: 'array',
                 items: {
-                    type: 'string'
+                    type: ""
                 },
                 description: 'Specific rules to apply (optional)'

[Survived] ArrayDeclaration
src/types/mcp.ts:164:19
                 description: 'Specific rules to apply (optional)'
             }
         },
-        required: ['code', 'language']
+        required: []
     }
 };

[Survived] StringLiteral
src/types/mcp.ts:164:20
                 description: 'Specific rules to apply (optional)'
             }
         },
-        required: ['code', 'language']
+        required: ["", 'language']
     }
 };
